In [1]:
import numpy as np
import pandas as pd

/home/chinmay/anaconda3/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)
/home/chinmay/anaconda3/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)

In [41]:
mtns = pd.DataFrame([
    {'name': 'Mount Everest',
        'height (m)': 8848,
        'summited': 1953,
        'mountain range': 'Mahalangur Himalaya'},
    {'name': 'K2',
        'height (m)': 8611,
        'summited': 1954,
        'mountain range': 'Baltoro Karakoram'},
    {'name': 'Kangchenjunga',
        'height (m)': 8586,
        'summited': 1955,
        'mountain range': 'Kangchenjunga Himalaya'},
    {'name': 'Lhotse',
        'height (m)': 8516,
        'summited': 1956,
        'mountain range': 'Mahalangur Himalaya'},
])

In [42]:
mtns.head()

   height (m)          mountain range           name  summited
0        8848     Mahalangur Himalaya  Mount Everest      1953
1        8611       Baltoro Karakoram             K2      1954
2        8586  Kangchenjunga Himalaya  Kangchenjunga      1955
3        8516     Mahalangur Himalaya         Lhotse      1956

In [5]:
mtns.describe()

        height (m)     summited
count     4.000000     4.000000
mean   8640.250000  1954.500000
std     144.218295     1.290994
min    8516.000000  1953.000000
25%    8568.500000  1953.750000
50%    8598.500000  1954.500000
75%    8670.250000  1955.250000
max    8848.000000  1956.000000

In [6]:
mtns

   height (m)          mountain range           name  summited
0        8848     Mahalangur Himalaya  Mount Everest      1953
1        8611       Baltoro Karakoram             K2      1954
2        8586  Kangchenjunga Himalaya  Kangchenjunga      1955
3        8516     Mahalangur Himalaya         Lhotse      1956

In [43]:
mtns.set_index('name', inplace=True)

In [44]:
mtns

               height (m)          mountain range  summited
name
Mount Everest        8848     Mahalangur Himalaya      1953
K2                   8611       Baltoro Karakoram      1954
Kangchenjunga        8586  Kangchenjunga Himalaya      1955
Lhotse               8516     Mahalangur Himalaya      1956

In [45]:
mtns.set_index(np.arange(4), inplace=True)
mtns

   height (m)          mountain range  summited
0        8848     Mahalangur Himalaya      1953
1        8611       Baltoro Karakoram      1954
2        8586  Kangchenjunga Himalaya      1955
3        8516     Mahalangur Himalaya      1956

In [12]:
mtns.loc[:, 'height (m)']

name
Mount Everest    8848
K2               8611
Kangchenjunga    8586
Lhotse           8516
Name: height (m), dtype: int64

In [13]:
mtns.loc[:, 'height (m)'].values

array([8848, 8611, 8586, 8516])

In [17]:
mtns.index

Index(['Mount Everest', 'K2', 'Kangchenjunga', 'Lhotse'], dtype='object', name='name')

In [16]:
mtns.loc[:, 'mountain range'].values

array(['Mahalangur Himalaya', 'Baltoro Karakoram',
       'Kangchenjunga Himalaya', 'Mahalangur Himalaya'], dtype=object)

In [21]:
mtns

               height (m)          mountain range  summited
name
Mount Everest        8848     Mahalangur Himalaya      1953
K2                   8611       Baltoro Karakoram      1954
Kangchenjunga        8586  Kangchenjunga Himalaya      1955
Lhotse               8516     Mahalangur Himalaya      1956

In [34]:
mtns.loc[(mtns.loc[:, 'summited'] >= 1954) &
         (mtns.loc[:, 'height (m)'] >= 8600), :]

      height (m)     mountain range  summited
name
K2          8611  Baltoro Karakoram      1954

In [30]:
mtns.loc[:, 'summited'] >= 1954

name
Mount Everest    False
K2                True
Kangchenjunga     True
Lhotse            True
Name: summited, dtype: bool

In [23]:
mtns.loc['Kangchenjunga', ['summited','height (m)']]

summited      1955
height (m)    8586
Name: Kangchenjunga, dtype: object

In [24]:
mtns.loc['Kangchenjunga', 'height (m)': 'summited']

height (m)                          8586
mountain range    Kangchenjunga Himalaya
summited                            1955
Name: Kangchenjunga, dtype: object

In [35]:
mtns.iloc[0, :]

height (m)                       8848
mountain range    Mahalangur Himalaya
summited                         1953
Name: Mount Everest, dtype: object

In [36]:
mtns.loc['Mount Everest', :]

height (m)                       8848
mountain range    Mahalangur Himalaya
summited                         1953
Name: Mount Everest, dtype: object

In [37]:
mtns

               height (m)          mountain range  summited
name
Mount Everest        8848     Mahalangur Himalaya      1953
K2                   8611       Baltoro Karakoram      1954
Kangchenjunga        8586  Kangchenjunga Himalaya      1955
Lhotse               8516     Mahalangur Himalaya      1956

In [40]:
mtns.iloc[:, 0:]

               height (m)          mountain range  summited
name
Mount Everest        8848     Mahalangur Himalaya      1953
K2                   8611       Baltoro Karakoram      1954
Kangchenjunga        8586  Kangchenjunga Himalaya      1955
Lhotse               8516     Mahalangur Himalaya      1956

In [ ]:


print(mtns)
print(mtns.loc[:, 'height (m)'])
print(mtns.loc[:, 'height (m)'].values)
print(mtns.loc[:, 'mountain range'])
print(mtns.loc['K2', :])
print(mtns.loc['K2', 'mountain range'])
print(mtns.loc[:, 'height (m)': 'summited'])
print(mtns.loc[:, ['height (m)', 'summited']])
print(mtns.loc[mtns.loc[:, 'summited'] > 1954, :])
print(mtns.iloc[0, :])
print(mtns.iloc[:, 2])
print(mtns.iloc[0, 2])
print(mtns.iloc[[1, 3], :])
print(mtns.iloc[:, 0:2])
print(mtns.iloc[:, 0:2].loc['K2', :])
print(mtns.iloc[:, 0].loc['K2', :])